import java.util.Map;

/**
 * Таблица критических значений для критерия Пирсона
 */
public class PearsonTable {
    /**
     * Таблица критических значений для критерия Пирсона
     */
    private final double[][] _pearsonTable = {
            {6.17908, 4.86518, 3.94030, 3.24697, 2.55821, 1.47874},
            {6.98867, 5.57778, 4.57481, 3.81575, 3.05348, 1.83385},
            {7.80733, 6.30380, 5.22603, 4.40379, 3.57057, 2.21421},
            {8.63386, 7.04150, 5.89186, 5.00875, 4.10692, 2.61722},
            {9.46733, 7.78953, 6.57063, 5.62873, 4.66043, 3.04067},
            {10.30696, 8.54676, 7.26094, 6.26214, 5.22935, 3.48268},
            {11.15212, 9.31224, 7.96165, 6.90766, 5.81221, 3.94163},
            {12.00227,10.08519, 8.67176, 7.56419, 6.40776, 4.41609},
            {12.85695,10.86494, 9.39046, 8.23075, 7.01491, 4.90485},
            {13.71579,11.65091,10.11701, 8.90652, 7.63273, 5.40682},
            {14.57844,12.44261,10.85081, 9.59078, 8.26040, 5.92104},
            {15.44461,13.23960,11.59131,10.28290, 8.89720, 6.44668},
            {16.31404,14.04149,12.33801,10.98232, 9.54249, 6.98297},
            {17.18651,14.84796,13.09051,11.68855,10.19572, 7.52924},
            {18.06180,15.65868,13.84843,12.40115,10.85636, 8.08488},
            {18.93975,16.47341,14.61141,13.11972,11.52398, 8.64934},
            {19.82019,17.29188,15.37916,13.84390,12.19815, 9.22213}
    };

    /**
     * Соответствие уровня значимости индексу столбца в матрице
     */
    private final Map<Double, Integer> _signLevels = Map.ofEntries(
            Map.entry(0.2,0),
            Map.entry(0.1,1),
            Map.entry(0.05,2),
            Map.entry(0.025,3),
            Map.entry(0.01, 4),
            Map.entry(0.005, 5)
    );

    /**
     * Получение критического значения
     * @param degreesOfFreedom Количество степеней свободы
     * @param significanceLevel Количество уровней значимости
     * @return Критическое значение
     */
    public double getCritivalValue(int degreesOfFreedom, double significanceLevel){
        return _pearsonTable[degreesOfFreedom-10][_signLevels.get(significanceLevel)];
    }
}
